#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main () {
    //متغير لتخزين السلسه الرئيسية واللي بتمثل رمز المستخدم
    string s;
    //ناخذ السلسله من المستخدم
    cin >> s;
    //نعرف ماب عشان نحسب مرات تكرار كل سلسلة فرعية
    map<string,int> mp;
    //بنمر على كل حروف السلسله النصيه ونخزن جميع السلاسل الفرعية
    //mp[s.substr(i,4)]++ : اذا كانت السلسله موجودة من قبل بيزود على القيمة حقتها واحد واذا اول مره تجي بيخزنها ويخلي قيمتها واحد
    for (int i = 0 ; i <  s.size() ; i++) {
        mp[s.substr(i,4)]++;
    }
    //نعرف متغير عشان نحسب عدد السلاسل الفرعية اللي حققت شرط القدرة الخاصه 
    //الشرط :  يتكون من اربع احرف وتكررت ثلاث مرات فأكثر
    int sum = 0;
    //بنمر على الماب حقتنا اللي خزنا فيها جميع السلاسل الفرعية وكم تكرروا
    for (auto mp:mp){
        // اذا كانت القيمة حقت السلسله الفرعية هذي اكبر من او يساوي ثلاثه بنزود قيمة العداد
       if(mp.second>=3){
        sum++;
       }
    }
    //نطبع النتيجة 
    cout << sum << endl;
}
