#include <iostream>
#include <stack>
#include <string>
#include <algorithm>

using namespace std;

int main() {
    //نعرف متغير يمثل حالات الاختبار
    int T;
    //بنسمح للمستخدم يدخل عدد يمثل عدد حالات الاختبار
    cin >> T;
    //بنعيد الخطوات الاتيه لكل تست كيس 
    while (T--) {
        //بنسمح للمستخدم يدخل السلسله النصيه
        string s;
        getline(cin, s);
        //عرفنا stack عشان نستخدمها لحل المسأله للتحقق من صحتها
        stack<char> stk;
        //متغير يمثل حالة السلسله والافتراضي انها بتكون صالحة
        bool flag = true;
        //لوب عشان نمر على الحروف في السلسلة النصية
        for (int i = 0; i < s.size(); ++i) {
            //اذا كان الحرف هو قوس فتحه 
            // بنضيفه للاستاك
            if (s[i] == '(' || s[i] == '[') {
            stk.push(s[i]);
            }
            //اذا كان الحرف هو قوس قفله من النوع المايل عندنا خيارين
            else if (s[i] == ')') {
                //1- اذا كانت الاستاك فيها عناصر والرأس هو قفله من نفس نوع القوس 
                //بنحذف الفتحة حقته من الاستاك
                if (stk.size() && stk.top() == '(') stk.pop();
                //2- اذا كانت الاستاك فاضيه او ما كان الاعلى فتحة من نفس نوع القوس
                //بتصير قيمة الفلاق فولس لانها صارت غير صالحة
                else flag = false;
            }
            //اذا كان الحرف هو قوس قفله من النوع المربع عندنا خيارين
            else { 
                //1- اذا كانت الاستاك فيها عناصر والرأس هو قفله من نفس نوع القوس 
                //بنحذف الفتحة حقته من الاستاك
                if (stk.size() && stk.top() == '[') stk.pop();
                //2- اذا كانت الاستاك فاضيه او ما كان الاعلى فتحة من نفس نوع القوس
                //بتصير قيمة الفلاق فولس لانها صارت غير صالحة
                else flag = false;
            }
        }
        //اذا خلصنا كل الاحرف وبقي في الاستاك اي شي  فيعني ان السلسه غير صالحة
         // فنخلي الفلاق فولس , والسبب انه لازم تكون فاضيه لانه يعني ان كل قوس له قفلته
        if (stk.size()) flag = false;
        //اذا كانت قيمة الفلاق ترو يعني السلسله صالحة ببالتالي يطبع يس , غير كذا نو
        cout << (flag ? "Yes\n" : "No\n");
    }
    return 0;
}