import java.util.Scanner;
import java.util.Stack;

public class B {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        //بنسمح للمستخدم يدخل عدد يمثل عدد حالات الاختبار ونخزنه بالمتغير تي
        int T = scanner.nextInt();
        //بنعيد الخطوات الاتيه لكل تست كيس 
        while (T-- > 0) {
            //بنسمح للمستخدم يدخل السلسله النصيه
            String s = scanner.nextLine();
            //عرفنا stack عشان نستخدمها لحل المسأله للتحقق من صحتها
            Stack<Character> stk = new Stack<>();
            //متغير يمثل حالة السلسله والافتراضي انها بتكون صالحة
            boolean flag = true;
            //لوب عشان نمر على الحروف في السلسلة النصية
            for (int i = 0; i < s.length(); ++i) {
                //اذا كان الحرف هو قوس فتحه 
                // بنضيفه للاستاك
                if (s.charAt(i) == '(' || s.charAt(i) == '[') {
                    stk.push(s.charAt(i));
                    //اذا كان الحرف هو قوس قفله من النوع المايل عندنا خيارين
                } else if (s.charAt(i) == ')') {
                    //1- اذا كانت الاستاك فيها عناصر والرأس هو قفله من نفس نوع القوس 
                    //بنحذف الفتحة حقته من الاستاك
                    if (!stk.isEmpty() && stk.peek() == '(') {
                        stk.pop();
                    //2- اذا كانت الاستاك فاضيه او ما كان الاعلى فتحة من نفس نوع القوس
                    //بتصير قيمة الفلاق فولس لانها صارت غير صالحة
                    } else {
                        flag = false;
                    }
                    //اذا كان الحرف هو قوس قفله من النوع المربع عندنا خيارين
                } else {
                    //1- اذا كانت الاستاك فيها عناصر والرأس هو قفله من نفس نوع القوس 
                    //بنحذف الفتحة حقته من الاستاك
                    if (!stk.isEmpty() && stk.peek() == '[') {
                        stk.pop();
                     //2- اذا كانت الاستاك فاضيه او ما كان الاعلى فتحة من نفس نوع القوس
                    //بتصير قيمة الفلاق فولس لانها صارت غير صالحة
                    } else {
                        flag = false;
                    }
                }
            }
            //اذا خلصنا كل الاحرف وبقي في الاستاك اي شي  فيعني ان السلسه غير صالحة
            // فنخلي الفلاق فولس , والسبب انه لازم تكون فاضيه لانه يعني ان كل قوس له قفلته
            if (!stk.isEmpty()) {
                flag = false;
            }
            //اذا كانت قيمة الفلاق ترو يعني السلسله صالحة ببالتالي يطبع يس , غير كذا نو
            System.out.println(flag ? "Yes" : "No");
        }
    }
}
