#بنسمح للمستخدم يدخل عدد يمثل عدد حالات الاختبار ونخزنه بالمتغير تي
T = int(input())

# بنعيد الخطوات الاتيه لكل تست كيس 
for _ in range(T):
    #بنسمح للمستخدم يدخل السلسله النصيه
    s = input()  
    #عرفنا stack عشان نستخدمها لحل المسأله للتحقق من صحتها
    stk = []
    #متغير يمثل حالة السلسله والافتراضي انها بتكون صالحة 
    flag = True

    #لوب عشان نمر على الحروف في السلسلة النصية
    for i in range(len(s)):
        # اذا كان الحرف هو قوس فتحه 
        # بنضيفه للاستاك
        if s[i] == '(' or s[i] == '[':
            stk.append(s[i])
        # اذا كان الحرف هو قوس قفله من النوع المايل عندنا خيارين
        elif s[i] == ')':
            # 1- اذا كانت الاستاك فيها عناصر والرأس هو قفله من نفس نوع القوس 
            # بنحذف الفتحة حقته من الاستاك
            if stk and stk[-1] == '(':
                stk.pop()
            #2- اذا كانت الاستاك فاضيه او ما كان الاعلى فتحة من نفس نوع القوس
            #بتصير قيمة الفلاق فولس لانها صارت غير صالحة
            else:
                flag = False
        #اذا كان الحرف هو قوس قفله من النوع المربع عندنا خيارين
        else:
            #1- اذا كانت الاستاك فيها عناصر والرأس هو قفله من نفس نوع القوس 
            #بنحذف الفتحة حقته من الاستاك
            if stk and stk[-1] == '[':
                stk.pop()
            #2- اذا كانت الاستاك فاضيه او ما كان الاعلى فتحة من نفس نوع القوس
            #بتصير قيمة الفلاق فولس لانها صارت غير صالحة
            else:
                flag = False
    # اذا خلصنا كل الاحرف وبقي في الاستاك اي شي  فيعني ان السلسه غير صالحة
    # فنخلي الفلاق فولس , والسبب انه لازم تكون فاضيه لانه يعني ان كل قوس له قفلته
    if stk: 
        flag = False
    # اذا كانت قيمة الفلاق ترو يعني السلسله صالحة ببالتالي يطبع يس , غير كذا نو
    print("Yes" if flag else "No")
